export const russianLayout = [
  ["Y", "C", "U", "K", "E", "N", "G", "Sh", "Shh", "Z", "X"],
  ["Ъ", "F", "AH", "V", "A", "P", "R", "O", "L", "D", "G"],
  ["E", "I AM", "H", "S", "M", "And", "T", "B", "B", "Yu", "É"],
  ["Space", ".", "!", "?", "-", `'`, `""`, ":", "(", ")"],
];

export const gagauzLayout = [
  ["A", "Â", "B", "C", "Ç", "D", "E", "Ê", "F", "G", "H"],
  ["i", "l", "J", "K", "L", "M", "N", "O", "Ö", "P", "R"],
  ["S", "Ş", "T", "🙂", "U", "Ü", "V", "Y", "Z", "Space"],
  [".", ",", "!", "?", "-", `'`, `""`, ":", ";", "(", ")"],
];

export const englishLayout = [
  ["Q", "W", "E", "R", "T", "Y", "U", "I", "O", "P", "A"],
  ["S", "D", "F", "G", "H", "J", "K", "L", "Z", "X", "C"],
  ["V", "B", "N", "M", "Space", ".", ",", "!", "?", "-"],
  [`'`, `"`, ":", ";", "(", ")"],
];

export const specialChars = ["ı", "ê", "ä", "ü", "ö", "ç", "ş", "ț"];
export const WCASE_LIST = [
  "Именительный",
  "Именительный",
  "Родительный",
  "Дательный",
  "Винительный",
  "Творительный",
  "Предложный",
];

export const WTYPE_LIST = ["единственное число", "множественное число"];
